In [1]:
# Install pandas library
!pip install pandas

Requirement already satisfied: pandas in c:\users\rakes\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\rakes\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\rakes\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\rakes\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\rakes\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\rakes\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
# importing pandas
import pandas as pd
# import numpy
import numpy as np

In [3]:
# Creating Series
fruits = ['Apple','Banana','Cherry','Orange']
data = pd.Series(fruits)
data

0     Apple
1    Banana
2    Cherry
3    Orange
dtype: object

In [4]:
marks = [90,80,95,85,92]
data = pd.Series(marks,index=['a','b','c','d','e'])
data

a    90
b    80
c    95
d    85
e    92
dtype: int64

In [5]:
# Accessing elements
data['a']

90

In [6]:
# Knowing the data type
data.dtype

dtype('int64')

In [7]:
ages = {
    'Rakesh' : 22,
    'Rohith' : 21,
    'GOpi' : 25,
    'Vinay' : 29
}
ages

{'Rakesh': 22, 'Rohith': 21, 'GOpi': 25, 'Vinay': 29}

In [8]:
age = pd.Series(ages)
age

Rakesh    22
Rohith    21
GOpi      25
Vinay     29
dtype: int64

In [9]:
age[0]

C:\Users\rakes\AppData\Local\Temp\ipykernel_74976\582415807.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  age[0]

22

In [10]:
age['Vinay']

29

In [11]:
age.mean()

24.25

In [12]:
age.median()

23.5

In [13]:
age.std()

3.593976442141304

In [14]:
age.var()

12.916666666666666

In [15]:
# Creating a series with null values
nums = [1,2,3,np.nan,4,5,np.nan]
nums

[1, 2, 3, nan, 4, 5, nan]

In [16]:
num = pd.Series(nums)
num

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
6    NaN
dtype: float64

In [17]:
# Finding null values
num.isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
dtype: bool

In [18]:
# To know how many null values
num.isnull().sum()

2

In [19]:
# Filling null values with random numbers
num.fillna(np.random.randint(10))

0    1.0
1    2.0
2    3.0
3    8.0
4    4.0
5    5.0
6    8.0
dtype: float64

In [20]:
type(num)

pandas.core.series.Series

In [21]:
# Creating DataFrame
grades = {
    "Names" : ["Rakesh","Vinay","Gopi","hhh"],
    "Marks" : [80,89,90,98],
    "GPA" : [8.5,9.0,9.5,8.0]
    
}
grades

{'Names': ['Rakesh', 'Vinay', 'Gopi', 'hhh'],
 'Marks': [80, 89, 90, 98],
 'GPA': [8.5, 9.0, 9.5, 8.0]}

In [22]:
indexes = [1,2,3,4]
indexes

[1, 2, 3, 4]

In [23]:
index = pd.Series(indexes)
index

0    1
1    2
2    3
3    4
dtype: int64

In [24]:
grade = pd.DataFrame(grades,index)
grade

    Names  Marks  GPA
1  Rakesh     80  8.5
2   Vinay     89  9.0
3    Gopi     90  9.5
4     hhh     98  8.0

In [25]:
grade.loc[1]

Names    Rakesh
Marks        80
GPA         8.5
Name: 1, dtype: object

In [26]:
grade.loc[:,["Names"]]

    Names
1  Rakesh
2   Vinay
3    Gopi
4     hhh

In [27]:
grade.loc[1:3,["Names","GPA"]]

    Names  GPA
1  Rakesh  8.5
2   Vinay  9.0
3    Gopi  9.5

In [28]:
grade.iloc[0]

Names    Rakesh
Marks        80
GPA         8.5
Name: 1, dtype: object

In [29]:
grade.head(2)

    Names  Marks  GPA
1  Rakesh     80  8.5
2   Vinay     89  9.0

In [30]:
grade.tail(2)

  Names  Marks  GPA
3  Gopi     90  9.5
4   hhh     98  8.0

In [31]:
grade.sample(2)

  Names  Marks  GPA
4   hhh     98  8.0
3  Gopi     90  9.5

In [32]:
grade.duplicated()

1    False
2    False
3    False
4    False
dtype: bool

In [33]:
# Uploading own csv file
df = pd.read_csv("data.csv")
df.head()

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0

In [34]:
df.shape

(32, 5)

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  32 non-null     int64
 1   Date      31 non-null     object
 2   Pulse     32 non-null     int64
 3   Maxpulse  32 non-null     int64
 4   Calories  30 non-null     float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.4+ KB

In [36]:
df.describe()

         Duration       Pulse    Maxpulse    Calories
count   32.000000   32.000000   32.000000   30.000000
mean    68.437500  103.500000  128.500000  304.680000
std     70.039591    7.832933   12.998759   66.003779
min     30.000000   90.000000  101.000000  195.100000
25%     60.000000  100.000000  120.000000  250.700000
50%     60.000000  102.500000  127.500000  291.200000
75%     60.000000  106.500000  132.250000  343.975000
max    450.000000  130.000000  175.000000  479.000000

In [37]:
df.columns

Index(['Duration', 'Date', 'Pulse', 'Maxpulse', 'Calories'], dtype='object')

In [38]:
# Access single column
df['Pulse']

0     110
1     117
2     103
3     109
4     117
5     102
6     110
7     104
8     109
9      98
10    103
11    100
12    100
13    106
14    104
15     98
16     98
17    100
18     90
19    103
20     97
21    108
22    100
23    130
24    105
25    102
26    100
27     92
28    103
29    100
30    102
31     92
Name: Pulse, dtype: int64

In [39]:
df.isnull().sum()

Duration    0
Date        1
Pulse       0
Maxpulse    0
Calories    2
dtype: int64

In [40]:
# There are 2 missing values in calories column we need to handle missing values by filling
df['Calories'].fillna(df['Calories'].mode()[0],inplace=True)

C:\Users\rakes\AppData\Local\Temp\ipykernel_74976\2444408390.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Calories'].fillna(df['Calories'].mode()[0],inplace=True)

In [41]:
df.isnull().sum()

Duration    0
Date        1
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [42]:
df['Maxpulse'].mean()

128.5

In [43]:
df['Maxpulse'].median()

127.5

In [44]:
df['Maxpulse'].mode()

0    120
Name: Maxpulse, dtype: int64

In [45]:
df['Maxpulse'].std()

12.998759246000514

In [46]:
df['Maxpulse'].var()

168.96774193548387